'use client';

import { Card, CardContent, CardHeader, CardTitle } from '@/components/ui/card';

export default function RefundPolicyPage() {
  return (
    <div className="container mx-auto px-4 py-12">
      <Card>
        <CardHeader>
          <CardTitle className="text-3xl font-bold">
            Πολιτική επιστροφής χρημάτων
          </CardTitle>
        </CardHeader>
        <CardContent className="prose max-w-none dark:prose-invert">
            <p>Έχουμε πολιτική επιστροφής 14 ημερών, που σημαίνει ότι εντός 14 ημερών μετά την παραλαβή του προϊόντος σας μπορείτε να ζητήσετε την επιστροφή του εφόσον βρίσκεται στην αρχική του κλειστή συσκευασία με την προυπόθεση ότι ο πελάτης δέχεται να πληρώσει τα μεταφορικά της αποστολής και της επιστροφής του προιόντος στο πραγματικό τους κόστος ακόμη και αν δέχτηκε δωρεάν μεταφορικά.</p>

            <p>Για να δικαιούστε επιστροφή, το προϊόν σας πρέπει να είναι στην ίδια κατάσταση που το παραλάβατε, αχρησιμοποίητο, με τις ετικέτες και στην αρχική του συσκευασία. Θα χρειαστείτε επίσης την απόδειξη ή το αποδεικτικό αγοράς. Για να ξεκινήσετε τη διαδικασία επιστροφής, μπορείτε να επικοινωνήσετε μαζί μας στο salesepiplagrafeiou@gmail.com. 
            Εάν το προϊόν που επιστρέφετε γίνει δεκτό, θα σας στείλουμε μια ετικέτα αποστολής επιστροφής, καθώς και οδηγίες για το πώς και πού να στείλετε το δέμα σας. Αντικείμενα που μας αποστέλλονται χωρίς πρώτα να ζητήσετε επιστροφή δεν θα γίνονται δεκτά.</p>

            <p>Μπορείτε πάντα να επικοινωνήσετε μαζί μας για οποιαδήποτε ερώτηση σχετικά με το προϊόν που επιστρέφετε στο salesepiplagrafeiou@gmail.com.</p>

            <h2>Ζημιές και ζητήματα</h2>
            <p>Να επιθεωρείτε την παραγγελία σας κατά την παραλαβή και να επικοινωνήσετε μαζί μας αμέσως καθώς σε περίπτωση ζημίας απο το πρακτορείο θα πρέπει να συνενοηθήτε με το πρακτορείο αμέσως και να μην γίνει υπογραφ΄γη του εγγράφου καθώς μετα δεν φέρει ευθύνη για την οπιαδήποτε ζημία όσο και το κατάστημα. Εάν το προϊόν είναι ελαττωματικό, κατεστραμμένο ή εάν παραλάβατε λάθος προϊόν, ώστε να μπορέσουμε να αξιολογήσουμε το ζήτημα και να το διορθώσουμε.</p>

            <h2>Εξαιρέσεις / μη επιστρεπτέα είδη</h2>
            <p>Ορισμένοι τύποι ειδών δεν μπορούν να επιστραφούν, όπως, προσαρμοσμένα προϊόντα (π.χ. ειδικές παραγγελίες ή εξατομικευμένα είδη). Επικοινωνήστε μαζί μας εάν έχετε ερωτήσεις ή ανησυχίες σχετικά με το συγκεκριμένο προϊόν.</p>
            <p>Δυστυχώς, δεν μπορούμε να δεχτούμε επιστροφές σε είδη προσφοράς ή δωροκάρτες.</p>

            <h2>Ανταλλαγές</h2>
            <p>Ο γρηγορότερος τρόπος για να εξασφαλίσετε ότι θα πάρετε αυτό που θέλετε είναι να επιστρέψετε το προϊόν που έχετε και μόλις γίνει δεκτή η επιστροφή, να κάνετε ξεχωριστή αγορά για το νέο προϊόν.</p>

            <h2>Περίοδος αναμονής 14 ημερών Ευρωπαϊκής Ένωσης</h2>
            <p>Παρά τα παραπάνω, εάν το εμπόρευμα αποστέλλεται στην Ευρωπαϊκή Ένωση, έχετε το δικαίωμα να ακυρώσετε ή να επιστρέψετε την παραγγελία σας εντός 14 ημερών, για οποιονδήποτε λόγο και χωρίς αιτιολόγηση. Όπως παραπάνω, το προϊόν σας πρέπει να είναι στην ίδια κατάσταση που το παραλάβατε, αφόρετο ή αχρησιμοποίητο, με τις ετικέτες και στην αρχική του συσκευασία. Θα χρειαστείτε επίσης την απόδειξη ή το αποδεικτικό αγοράς.</p>

            <h2>Επιστροφές χρημάτων</h2>
            <p>Θα σας ειδοποιήσουμε μόλις παραλάβουμε και ελέγξουμε το προϊόν που επιστρέφετε και θα σας ενημερώσουμε αν εγκρίθηκε ή όχι η επιστροφή χρημάτων. Εάν εγκριθεί, θα σας επιστραφεί αυτόματα το ποσό στην αρχική σας μέθοδο πληρωμής εντός 10 εργάσιμων ημερών. Να θυμάστε ότι μπορεί να χρειαστεί λίγος χρόνος για την επεξεργασία και την αποστολή της επιστροφής χρημάτων από την τράπεζα ή την εταιρεία της πιστωτικής σας κάρτας. Εάν έχουν περάσει περισσότερες από 15 εργάσιμες ημέρες από τότε που εγκρίναμε το προϊόν που επιστρέφετε, επικοινωνήστε μαζί μας στο salesepiplagrafeiou@gmail.com.</p>
        </CardContent>
      </Card>
    </div>
  );
}
